<?php
echo "<meta charset='utf-8'>";
function ThDate()
{
//วันภาษาไทย
$ThDay = array ( "อาทิตย์", "จันทร์", "อังคาร", "พุธ", "พฤหัส", "ศุกร์", "เสาร์" );
//เดือนภาษาไทย
$ThMonth = array ( "มกราคม", "กุมภาพันธ์", "มีนาคม", "เมษายน","พฤษภาคม", "มิถุนายน", "กรกฏาคม", "สิงหาคม","กันยายน", "ตุลาคม", "พฤศจิกายน", "ธันวาคม" );

 
//วันที่ ที่ต้องการเอามาเปลี่ยนฟอแมต
$myDATE = ("2022-09-22"); //อาจมาจากฐานข้อมูล
//กำหนดคุณสมบัติ
$week = date("w",strtotime($myDATE)); // ค่าวันในสัปดาห์ (0-6)
$months = date("m",strtotime($myDATE))-1; // ค่าเดือน (1-12)
$day = date("d",strtotime($myDATE)); // ค่าวันที่(1-31)
$years = date("Y",strtotime($myDATE))+543; // ค่า ค.ศ.บวก 543 ทำให้เป็น ค.ศ.
 
return "วัน$ThDay[$week] 
		ที่ $day  
		เดือน $ThMonth[$months] 
		พ.ศ. $years";
}
echo ThDate(); // แสดงวันที่ 
?>